{
  "('Sun', 'Aries')": "Solar vitality expresses through pioneering action, courage, and fiery assertion. Life purpose centers on initiating new cycles.",
  "('Sun', 'Taurus')": "Solar essence manifests through grounding, stability, and sensory connection. Life purpose involves building lasting value.",
  "('Sun', 'Gemini')": "Solar force flows through communication, curiosity, and mental agility. Life purpose centers on connecting ideas and people.",
  "('Sun', 'Cancer')": "Solar nature expresses nurturing, emotional depth, and protective instinct. Life purpose involves creating emotional safety.",
  "('Sun', 'Leo')": "Solar power radiates creative expression, courage, and authentic leadership. Life purpose centers on creative self-actualization.",
  "('Sun', 'Virgo')": "Solar energy manifests through precision, service, and discernment. Life purpose involves refining and improving systems.",
  "('Moon', 'Aries')": "Emotional nature is spontaneous, courageous, and action-oriented. Inner world seeks immediate authentic response.",
  "('Moon', 'Taurus')": "Emotional needs center on stability, comfort, and sensory pleasure. Inner world requires grounding and security.",
  "('Moon', 'Gemini')": "Emotional expression is curious, adaptable, and communication-based. Inner world needs variety and mental stimulation.",
  "('Moon', 'Cancer')": "Emotional depth is profound, protective, and family-oriented. Inner world seeks emotional safety and belonging.",
  "('Moon', 'Leo')": "Emotional nature seeks creative expression, recognition, and warmth. Inner world needs to feel valued and appreciated.",
  "('Moon', 'Virgo')": "Emotional response is analytical, service-oriented, and health-focused. Inner world seeks order and practical support.",
  "('Mercury', 'Gemini')": "Mind dances through multiplicity, language is your superpower. Communication carries layers of meaning and connection.",
  "('Mercury', 'Virgo')": "Mind excels at analysis, organization, and practical problem-solving. Communication precise and detail-oriented.",
  "('Mercury', 'Sagittarius')": "Mind seeks truth, philosophy, and big-picture understanding. Communication expansive and wisdom-driven.",
  "('Venus', 'Libra')": "Love seeks harmony, balance, and aesthetic refinement. Relationships are mirrors for personal growth.",
  "('Venus', 'Taurus')": "Love is loyal, sensual, and values-driven. Relationships grounded in stability and material security.",
  "('Venus', 'Pisces')": "Love dissolves boundaries, seeks unity, and flows with empathy. Relationships transcend ordinary connection.",
  "('Mars', 'Aries')": "Will-power burns with raw courage and pioneering drive. Action taken decisively and directly.",
  "('Mars', 'Scorpio')": "Will-power manifests through depth, intensity, and strategic focus. Action stems from emotional conviction.",
  "('Mars', 'Capricorn')": "Will-power channels into sustained effort and strategic mastery. Action disciplined and goal-oriented.",
  "('Jupiter', 'Sagittarius')": "Expansion flows through philosophy, truth-seeking, and visionary thinking. Luck found through faith and adventure.",
  "('Jupiter', 'Pisces')": "Expansion manifests as spiritual growth, compassion, and imagination. Luck through faith and surrender.",
  "('Saturn', 'Capricorn')": "Mastery achieved through discipline, structure, and strategic authority. Lessons teach responsibility and integrity.",
  "('Saturn', 'Aquarius')": "Mastery through innovation, boundaries, and detached wisdom. Lessons teach authentic individuality.",
  "('North Node', 'Gemini')": "Soul evolves toward communication, adaptability, and intellectual expansion. Learn to hold multiple truths.",
  "('North Node', 'Pisces')": "Soul evolves toward surrender, mysticism, and unconditional love. Learn to transcend ego and merge with all.",
  "('North Node', 'Taurus')": "Soul evolves toward grounding, values, and sensory presence. Learn to build lasting foundation.",
  "('North Node', 'Scorpio')": "Soul evolves toward depth, transformation, and emotional authenticity. Learn to embrace rebirth."
}